/**
 * @Description: 菜单类型
 *
 * @author Arc
 * @date 2020/8/6
 */
export enum MenuType {
  QHYY = '-100',//切换语言
  QTZD = '-101',//其它注单
  AQZX = '-102',//安全中心
  YHK = '-103',//银行卡管理
  CZJL = '-104',//存款记录
  TXJL = '-105',//取款记录
  WD = '-106',//我的
  GRXX = '-107',//个人信息
  LZ = '-108',//路珠
  CQK = '1',//存取款
  APP = '2', //app下载
  LTS = '3', //聊天室
  KF = '4', //客服
  CLZS = '5', //长龙助手
  SYTJ = '6', //收益推荐
  KJW = '7', //开奖网
  LXB = '8', //利息宝
  YHDD = '9', //优惠活动
  YXJL = '10', //游戏记录
  QQ = '11', //qq客服
  WX = '12', //微信客服
  RWZX = '13', //任务中心
  ZLX = '14', //站内信
  QD = '15', //签到
  TSZX = '16', //投诉中心
  QMJC = '17', //全民竞彩
  SQCJ = '18', //申请彩金
  GCDT = '19', //购彩大厅
  HYZX = '20', //会员中心
  CZ = '21', //充值
  TX = '22', //提现
  EDZH = '23', //额度转换
  JSZD = '24', //即使注单
  JRSY = '25', //今日输赢
  KJJG = '26', //开奖结果
  DQBB = '27', //当前版本号
  ZHGL = '28', //资金明细
  HDNB = '29', //回电脑版
  FHSY = '30', //返回首页
  TCDL = '31', //退出登录
  TZJL = '32', //投注记录
  CZGZ = '33', //彩种规则
  HBJL = '36', //红包记录
  SLJL = '37', //扫雷记录
}
